Revit 2016 API
Application.NewPoint Method
Creates a new geometric point object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2016. Use the Point.Create() methods instead.")]
public Point NewPoint(
	XYZ coord
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2016. Use the Point.Create() methods instead.")> _
Public Function NewPoint ( _
	coord As XYZ _
) As Point
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2016. Use the Point.Create() methods instead.")]
public:
Point^ NewPoint(
	XYZ^ coord
)
Parameters
coord
Type: Autodesk.Revit.DB.XYZ
The coordinates of the point.
Remarks
See Also
Application Class
Autodesk.Revit.Creation Namespace